HOCOOH/STM32-Authentication/Src/main.c
// 密码相关函数
void UpdatePasswdBackup();
u8 IsPasswdValid();
u8 ResumePasswd(u8* validMask, Passwd* tmpPasswd);
uint8_t crc4_itu(uint8_t *data, uint16_t length);

// 输入输出相关
void swtich_key(void);
void switch_flag(void);
void I2C_Safe_Read(I2C_HandleTypeDef *I2Cx, uint8_t I2C_Addr, uint8_t addr, uint8_t *w_buf, uint8_t num);
void I2C_Safe_Write(I2C_HandleTypeDef *I2Cx, uint8_t I2C_Addr, uint8_t addr, uint8_t *w_buf, uint8_t num);
uint8_t I2C_check_write(I2C_HandleTypeDef *I2Cx, uint8_t I2C_Addr, uint8_t addr, uint8_t *check_value, uint8_t num);
void disp_null();
void disp_str(uint8_t* code);
void disp_in_serial(uint8_t* arr);

// 功能函数
void rand_delay();
void delay_ms(u32 time);
void mymemcpy(void* dest, const void* src, u32 len);
uint8_t cmp(uint8_t* arr1, uint8_t* arr2, uint8_t len);
uint32_t len(uint8_t* arr);

int main(void) {
    if (boot_flag != HOT_BOOT_FLAG) {
        // cold boot
		boot_flag = HOT_BOOT_FLAG;
        // init
        GlobalInit();

        /* 冷启动恢复密码 */
        if (IsPasswdValid()) {
             // printf("存储的密码损坏且无法恢复\n\r");
             // while (1) {}
             SM3_Hash(passwdDefault, len(passwdDefault), (void*)passwdRAM.hashVal);
             UpdatePasswdBackup();
        }
    } else {
        // hot boot
        // load the backend vars and check
			/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
        HAL_Init();

        /* Configure the system clock */
        SystemClock_Config();

        /* Initialize all configured peripherals */
        MX_GPIO_Init();
        MX_I2C1_Init();
        MX_USART1_UART_Init();
        time_count = 0;
        if (input_cursor != 0) {
            goto hot_restart;
        }
    }
    
    // printf("\n\r");
    // printf("\n\r===================================\n\r");
    // printf("\n\r FS-STM32身份验证系统\n\r");
    // printf("\n\r test : len(pass_store):%d\n\r", len(pass_store));
    // printf("\n\r test : pass_store:\n\r");
    // disp_in_serial(pass_store);
    
    // SM3_Hash(pass_store, len(pass_store), (void*)pass_store_sm3);
    // printf("SM3哈希后的pass_store:\n\r");
    // disp_in_serial(pass_store_sm3);
    // printf("\n\r");

    // 主循环
    while (1) {
        /* 初始化状态 */
        if (state.currentState == STATE_INIT) {
            /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
            HAL_Init();

            /* Configure the system clock */
            SystemClock_Config();

            /* Initialize all configured peripherals */
            MX_GPIO_Init();
            MX_I2C1_Init();
            MX_USART1_UART_Init();
            //MX_CRC_Init();

            /* Initialize variables */
           // refreshCount = REFRESH_COUNT_INIT;
            input_cursor = 0;
			edit_mode = 0;
            for (int i = 0; i < MAX_PASSWORD_LEN; i++) {
                pass_buf[i] = 0;
            }

            rand_delay();

            // switch to state wait
            UpdateState(STATE_WAIT);
        }
        /* 待机状态 */
        else if (state.currentState == STATE_WAIT) {
            rand_delay();
            if (IsStateValid(STATE_WAIT)) {
                state.errorCode = EXCEPT_UNVALIAD_STATE;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
            input_cursor = 0;
            /* 检测到输入，转到输入状态 */
            if (flagInterrupt == 1) {
                UpdateState(STATE_INPUT);
                continue;
            }
            // set refresh timer 
            //if (refreshCount-- == 0) {
                //UpdateState(STATE_INIT);
                //continue;
            //}
        }
        /* 输入状态 */
        else if (state.currentState == STATE_INPUT) {
					disp_null();
            rand_delay();
            if (IsStateValid(STATE_INPUT)) {
                state.errorCode = EXCEPT_UNVALIAD_STATE;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
						
						time_count = 0;
            // get input 
            while (input_cursor < MAX_PASSWORD_LEN) {
                hot_restart:							
                    if (time_count > 5000000 * TIMEOUT_THRESHOLD) {
                        time_count = 0;
                        state.errorCode = EXCEPT_TIMEOUT;
                        UpdateState(STATE_EXCEPTION); // return wait state 
                        goto expcetion_handler;
                    }
								
                if (flagInterrupt == 1) {
                    flagInterrupt = 0;
                    I2C_Safe_Read(&hi2c1,0x71,0x01,Rx1_Buffer,1);	//读键值
                    swtich_key();	//扫描键值，写标志位
					u8 tmpFlag = flag;
					I2C_Safe_Read(&hi2c1,0x71,0x01,Rx1_Buffer,1);	//读键值
                    swtich_key();	//扫描键值，写标志位
                    if (flag != tmpFlag) {
                            continue;
                    }
                    I2C_Safe_Read(&hi2c1,0x71,0x10,Rx2_Buffer,8);	//读8位数码管
                    switch_flag();	//扫描到相应的按键并且向数码管写进数值
                    printf("flag: %d\n\r", flag);

                    if (flag == 14) {// #
                        printf("Password input done!\n\r");
                        hashMark = 0;
                        break;
                    }
                    else if (flag == 16 && hashMark == 0) { // *
                        printf("Edit password\n\r");
                        hashMark = 1;
                        break;
                    }
                    else if (flag == 16 && hashMark == 1) { // *
                        state.errorCode = EXCEPT_UNVALIAD_INPUT;
                        UpdateState(STATE_EXCEPTION); // return wait state 
                        goto expcetion_handler;
                    }
                    else {
                        pass_buf[input_cursor++] = flag;
                    }
					time_count = 0;
                 // todo: 异常!!!:无效的字?
				}
				time_count++;
			}
            
			pass_buf[input_cursor] = 0;
            // 异常: 密码长度过长
            if (input_cursor >= MAX_PASSWORD_LEN) {
                printf("Password is too long\n\r");
                state.errorCode = EXCEPT_PASSLEN_LONG;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
            // 异常: 密码长度过短
            else if (input_cursor < MIN_PASSWORD_LEN) {
                printf("Password is too short\n\r");
                state.errorCode = EXCEPT_PASSLEN_SHORT;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
            // todo: 重复输入**********************
            IsStateValid(STATE_INPUT);
            printf("editmode:%d\n", edit_mode);
            /* 输入合法 */
            if (edit_mode == 1) {
                UpdateState(STATE_EDIT);
            }
            else {
				UpdateState(STATE_CHECK);
            }
        }
        /* 判断密码状态 */
        else if (state.currentState == STATE_CHECK) {
            rand_delay();
            if (IsStateValid(STATE_CHECK)) {
                state.errorCode = EXCEPT_UNVALIAD_STATE;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
            // printf("\n\rlen: %d  ", input_cursor);
            // printf("pass_buf:\n\r");
            // disp_in_serial(pass_buf);
            /* 对输入的密码进行SM3摘要 */
            SM3_Hash(pass_buf, len(pass_buf), (void*)pass_buf_sm3);
            printf("SM3 hash value of pass_buf: ");
            disp_in_serial(pass_buf_sm3);
            printf("SM3 hash value of pass_store: ");
            disp_in_serial(passwdRAM.hashVal);
            
            /* 比对输入摘要和真实密码摘要 */
            u8 check_sum = 0;
            for (int i = 0; i < 5; i++) {
                SM3_Hash(pass_buf, len(pass_buf), (void*)pass_buf_sm3);
                if (IsPasswdValid()) {
                    printf("存储的密码损坏且无法恢复\n\r");
                    while (1) {}
                }
                check_sum += cmp(pass_buf_sm3, passwdRAM.hashVal, DIGEST_LEN);
            }
            u8 cmp_res = (check_sum >= 3) ? 1 : 0;
            
