HOCOOH/STM32-Authentication/Src/main.c
            if (cmp_res == 0) { // 匹配
                // 显示success
                printf("password match!\n\r");
                uint8_t success_code[] = {0xB6, 0xB6, 0x9E, 0x9C, 0x9C, 0x7C, 0xB6};
                disp_str(success_code);
            
            } else { // 不匹配
                // 显示error
                printf("password not match!\n\r");
                // todo: edit code
                uint8_t error_code[] = {0x1C, 0x0C, 0xEE, 0x8E, 0};
                disp_str(error_code);
            }
            
            /* 返回待机状态 */
            edit_mode = hashMark;
            UpdateState(STATE_WAIT);
        }
        /* 修改密码状态 */
        else if (state.currentState == STATE_EDIT) {
            rand_delay();
            if (IsStateValid(STATE_EDIT)) {
                state.errorCode = EXCEPT_UNVALIAD_STATE;
                UpdateState(STATE_EXCEPTION);
                continue;
            }

            // 更新密码
            // for (int i = 0; i < MAX_PASSWORD_LEN; i++) {
            //     if (i < input_cursor)
            //         pass_store[i] = pass_buf[i];
            //     else
            //         pass_store[i] = 0;
            // }
            for (int i = input_cursor; i < MAX_PASSWORD_LEN; i++) {
                pass_buf[i] = 0;
            }
            SM3_Hash(pass_buf, len(pass_buf), (void*)passwdRAM.hashVal);
            UpdatePasswdBackup();

            // 显示update
            uint8_t up_code[] = {0xCE, 0x7C};
            disp_str(up_code);
            printf("Password update to:\n");
            disp_in_serial(pass_buf);
            
            /* 返回待机状态 */
            edit_mode = 0;
            UpdateState(STATE_WAIT);
        }
        /* 异常状态 */
        else {	// default 异常
expcetion_handler:
            rand_delay();
            // =============
            uint8_t error_code[] = {0, 0xEE, 0xFC, 0xEE, 0xEE, 0x9E, 0};
            u8 seg2code[] = {0xfc, 0x0c, 0xDA, 0xF2, 0x66, 0xB6, 0xBE, 0xE0, 0xFE, 0xE6};
            // 需要延时!!!
            switch (state.errorCode) {
                case EXCEPT_UNVALIAD_STATE:
					printf("ERROR:unvaliad state!\n");
                   // UpdateState(STATE_INIT);
                    break;
                case EXCEPT_TIMEOUT:
					printf("ERROR:time out!\n");
                    //UpdateState(STATE_WAIT);
                    break;
                case EXCEPT_PASSLEN_LONG:
				    printf("ERROR:pass long!\n");
                   // UpdateState(STATE_WAIT);
                    break;
                case EXCEPT_PASSLEN_SHORT:
					printf("ERROR:pass short!\n");
                   // UpdateState(STATE_WAIT);
                    break;
				case  EXCEPT_UNVALIAD_INPUT:
					printf("ERROR:unvalid input!\n");
                default:
                    //UpdateState(STATE_INIT);
					break;
            }
            error_code[0] = seg2code[state.errorCode];
            disp_str(error_code);
            UpdateState(STATE_INIT);
        }
    }
}

void GlobalInit() {
    edit_mode = 0;
    hashMark = 0;
    input_cursor = 0;
    
    flag = 0;//不同的按键有不同的标志位值
    flagInterrupt = 0;//中断标志位，每次按键产生一次中断，并开始读取8个数码管的值
    for (int i = 0; i <= MAX_PASSWORD_LEN; i++) {
        pass_buf[i] = 0;
    }
    for (int i = 0; i <= DIGEST_LEN; i++) {
        pass_buf_sm3[i] = 0;
    }
    passwdRAM = (Passwd){0};

    // reset state
    state.currentState = STATE_INIT;
    state.lastState = STATE_EXCEPTION;
    state.errorCode = 0;
    UpdateStateBackup();
}
void UpdateStateBackup() {
    for (int i = 0; i < N_BACKUP; i++) {
        mymemcpy((void*)(stateBackup + i), (void*)&state, sizeof(State));
    }
}



u8 IsStateValid(u8 expectState) {
	u8 randNum = rand() % 2;
	if (randNum == 1)
			return IsStateValid1(expectState);
	else
			return IsStateValid2(expectState);
}


u8 IsStateValid1(u8 expectState) {
	if (state.currentState != expectState) {
		return 1;
	}
	// check pre state
	u8 check_pre_res = prev_state_table[state.currentState][state.lastState];
	if (check_pre_res == 0) {
		return 1;
	}
    // check state backup
    for (int i = 0; i < N_BACKUP; i++) {
        if (cmp((u8*)&state, (u8*)(stateBackup + i), sizeof(State))) {
            return 1;
        }
    }

	return 0;	
}

u8 IsStateValid2(u8 expectState) {
	// check state backup
    for (int i = 0; i < N_BACKUP; i++) {
        if (cmp((u8*)&state, (u8*)(stateBackup + i), sizeof(State))) {
            return 1;
        }
    }
	
	// check pre state
	u8 check_pre_res = prev_state_table[state.currentState][state.lastState];
	if (check_pre_res == 0) {
		return 1;
	}

	if (state.currentState != expectState) {
		return 1;
	}
	return 0;	
}

void UpdateState(u8 nextState) {
    // TODO: check if next state is vaild
    state.lastState = state.currentState;
    state.currentState = nextState;

    if (nextState != STATE_EXCEPTION) {
        state.errorCode = 0;
    }

    // 备份state
    UpdateStateBackup();
}

uint8_t crc4_itu(uint8_t *data, uint16_t length) {
    uint8_t i;
    uint8_t crc = 0;                // Initial value
    while(length--)
    {
        crc ^= *data++;                 // crc ^= *data; data++;
        for (i = 0; i < 8; ++i)
        {
            if (crc & 1)
                crc = (crc >> 1) ^ 0x0C;// 0x0C = (reverse 0x03)>>(8-4)
            else
                crc = (crc >> 1);
        }
    }
    return crc;
}

void UpdatePasswdBackup() {
    passwdRAM.CRCVal = crc4_itu(passwdRAM.hashVal, DIGEST_LEN);
	// passwdCRC = HAL_CRC_Calculate(&hcrc, (u32*)pass_store_sm3, DIGEST_LEN / 4);
    for (int i = 0; i < N_BACKUP; i++) {
        STMFLASH_Write(ADDR_PASSWD_BACKUP(i), (u32*)&passwdRAM, PASSWD_LEN_U32);
    }
}

u8 IsPasswdValid() {
    u8 flag = 0;
    u8 validMask[N_BACKUP + 1] = {0};
    /* 首先校验密码备份 */
    u32 tmpCRC = 0;
    Passwd tmpPasswd[N_BACKUP + 1] = {0};
    for (int i = 0; i < N_BACKUP; i++) {
        STMFLASH_Read(ADDR_PASSWD_BACKUP(i), (u32*)(tmpPasswd + i), PASSWD_LEN_U32);
		tmpCRC = crc4_itu(tmpPasswd[i].hashVal, DIGEST_LEN);;
        if (tmpCRC == tmpPasswd[i].CRCVal) {
            validMask[i] = 1;
        }
    }
	tmpCRC = crc4_itu(passwdRAM.hashVal, DIGEST_LEN);;
    /* 检查密码哈希 */
    if (tmpCRC != passwdRAM.CRCVal) {
        flag = 1;
    }
    else {
        validMask[N_BACKUP] = 1;
        tmpPasswd[N_BACKUP].CRCVal = tmpCRC;
        mymemcpy((void*)tmpPasswd[N_BACKUP].hashVal, (void*)passwdRAM.hashVal, DIGEST_LEN);
        for (int i = 0; i < N_BACKUP; i++) {
            if (validMask[i] && tmpPasswd[i].CRCVal != passwdRAM.CRCVal) {
                flag = 1;
            }
        }
    }

    /* 若密码失效，尝试恢复 */
    if (flag) {
        flag = ResumePasswd(validMask, tmpPasswd);
    }

